src/InformationRegisters/ОбработкаСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ОбработкаСобытий</Name>
			<Comment>для обработки на рабочем месте</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Comment>Тип события</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Произвольное описание события</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдСобытия</Name>
					<Comment>Идентификатор марки или guid элемента</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ТипыСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ТипыСобытий</Name>
			<Comment>Типы событий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Сообщение</Name>
					<Comment>Произвольное текстовое сообщение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтопЛист</Name>
					<Comment>Обработка документа Стоп-лист</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланМеню</Name>
					<Comment>Обработка документа План-Меню</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МониторМарок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрактиръМобайлСообщение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТрактиръМобайлОтправкаНаПейджер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/ОбработкаСобытий/Ext/ManagerModule.bsl
Процедура СоздатьЗапись(Знач РабочееМесто = Неопределено, Знач ИдСобытия = "", Знач Дата = Неопределено, Знач ТипСобытия = Неопределено, Знач Описание = "", Знач Получатель = Неопределено) Экспорт
	
	Если РабочееМесто = Неопределено Тогда
		РабочееМесто = ПредопределенноеЗначение("Справочник.РабочиеМеста.ПустаяСсылка");
	КонецЕсли;
	Если ИдСобытия = "" Тогда
		ИдСобытия = Строка(Новый УникальныйИдентификатор);
	КонецЕсли;
	Если Дата = Неопределено Тогда
		Дата = ТекущаяДата();
	КонецЕсли; 
	Если ТипСобытия = Неопределено Тогда
		ТипСобытия = ПредопределенноеЗначение("Перечисление.ТипыСобытий.Сообщение");
	КонецЕсли; 
	Если Получатель = Неопределено Тогда
		Получатель = ПредопределенноеЗначение("Справочник.Сотрудники.ПустаяСсылка");
	КонецЕсли;
	
	ОбработкаСобытийЗапись = РегистрыСведений.ОбработкаСобытий.СоздатьМенеджерЗаписи();
	ОбработкаСобытийЗапись.Период			= Дата;
	ОбработкаСобытийЗапись.РабочееМесто		= РабочееМесто;
	ОбработкаСобытийЗапись.ИдСобытия		= ИдСобытия;
	ОбработкаСобытийЗапись.ТипСобытия		= ТипСобытия;
	ОбработкаСобытийЗапись.Описание			= Описание;
	ОбработкаСобытийЗапись.Получатель		= Получатель;
	ОбработкаСобытийЗапись.Записать();
	
КонецПроцедуры
